---
kind: method
id: M:Autodesk.Revit.DB.ConfigurationReloadInfo.Dispose
source: html/41b2c405-8504-3fd0-c308-b96a0a2ef607.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo.Dispose Method

Releases all resources used by the ConfigurationReloadInfo

## Syntax (C#)
```csharp
public void Dispose()
```